<?php

return [

    'client' => 'العميل',
    'clients' => 'العملاء',
    'add_clients' => 'إضافة عميل',
    'clients_search' => 'البحث عن عميل',
    'sales' => 'المبيعات',
    'no_data_to_show' => 'لا توجد بيانات متوفرة!',
    'reach-non-existent-customer' => 'محاولة وصول لعميل غير موجود',
    'edit_clients' => 'تعديل العميل',

    'edit_Supplier' => 'تعديل المورد',
    'Supplier' => 'المورد',
    'suppliers' => 'الموردين',
    'add_supplier' => 'إضافة مورد',
    'add_suppliers' => 'إضافة مورد',
    'suppliers_search' => 'البحث عن مورد ',

    'clients_loyalty_points_settings' => 'إعدادات نقاط الولاء للعميل',
    'points_earning_settings' => 'إعدادات كسب النقاط',
    'points_redemption_settings' => 'إعدادات استبدال النقاط',
    'loyalty_points' => 'نقاط الولاء',
    'amount_to_pay_to_earn_point_hint' => 'المبلغ الواجب على العميل إنفاقه للحصول على نفطة واحدة',
    'minimum_order_payment_to_earn_points_hint' => 'الحد الأدنى الذي يجب أن ينفقه العميل للحصول على نقاط المكافأة. مثال: إذا قمت بوضع مبلغ 1000 فعندها سيحصل العميل على النقاط إذا كانت الفاتورة أكبر أو يساوي 1000',
    'maximum_order_points_hint' => 'الحد الأقصى لنقاط المكافآت الذي يمكن للعميل كسبه في فاتورة واحدة، دع الحقل فارغاً في حال كنت لا تريد وضع حد',
    'redeemed_amount_for_each_point_hint' => 'يشير إلى مبلغ الاسترداد لكل نقطة. على سبيل المثال: إذا كانت النقطة الواحدة تسلوي 1 ريال، فأدخل القيمة على أنها 1. إذا كانت النقطتان تساوي 1 ريال، أدخل القيمة كـ 0.50',
    'minimum_order_payment_to_redeem_points_hint' => 'الحد الأدنى لإجمالي الطلب الذي يمكن للعميل استبدال النقاط به. اتركه فارغًا إذا كنت لا تحتاج إلى هذا التقييد',
    'minimum_points_hint' => 'الحد الأدنى للنقاط التي يمكن استخدامها في كل فاتورة. اتركها فارغة إذا كنت لا تحتاج إلى هذا القيد',
    'maximum_redeem_point_per_order_hint' => 'الحد الأقصى للنقاط التي يمكن استخدامها بطلب واحد. اتركه فارغًا إذا كنت لا تحتاج إلى هذا التقييد',
    'points_expiration_period_hint' => 'فترة انتهاء الصلاحية للنقاط التي يكسبها العميل. سيتم خصم النقاط منتهية الصلاحية من حساب العميل تلقائيًا بعد هذه الفترة',
    
];